{
  "projects": [
    {
      "id": 1,
      "projectName": "Employees’ PTO and Leave Tracker Software",
      "projectDescription": "Day Off is a mobile app targeting small and medium-sized companies to help them manage and track employeesleave and time off. Using a lightweight mobile app and comprehensive web dashboard, employees can request time off and managers will get notified instantly.",
      "projectType": "Web Application",
      "clientCountry": "Egypt",
      "clientIndustry": "Rental Cars",
      "clientLogo": "../../../assets/vendors/imgs/dayof.webp",
      "clientName": "Day off",
      "projectDuration": 2,
      "members": 4,
      "clientRating": 5,
      "features": [
        "Mobile App",
        "Web Dashboard",
        "Time Off Management",
        "Employee Request System",
        "Reporting & Analytics",
        "Integration with HR Systems"
      ],
      "projectImage": "../../../assets/vendors/imgs/Group-1000003927-1.webp",
      "clientReview": "توب التوب يا اكسبرت"
    },
    {
      "features": [
        "d",
        "c",
        "c"
      ],
      "projectName": "ddwdwdwd",
      "projectDescription": "dwdwddwwd",
      "projectType": "mobile",
      "clientCountry": "UK",
      "clientIndustry": "cwcwc",
      "clientLogo": "C:\\fakepath\\arrow-up-right.svg",
      "clientName": "fefef",
      "projectDuration": "7",
      "members": "7",
      "clientRating": "7",
      "projectImage": "C:\\fakepath\\blog1.jpeg",
      "clientReview": "fefefefefefrggthth",
      "id": 2
    },
    {
      "features": [
        "d"
      ],
      "id": 3
    }
  ],
  "blog": [
    {
      "id": 1,
      "title": "What is SPA",
      "date": "December 12, 2021",
      "image": "../../../assets/vendors/imgs/blog1.jpeg",
      "type": "Web Development",
      "description": "In the dynamic world of software development, where new technologies and methodologies emerge rapidly, one challenge remains constant: dealing with legacy code. Legacy code, often defined as outdated or inherited code that lacks proper documentation or is difficult to maintain, can be both a burden and a necessity. Whether you’re maintaining an old system or integrating new features into an existing application, understanding how to navigate the complexities of legacy code is essential for developers.challenges of legacy code is a complex but vital part of Enozom’s software development services. By employing strategies such as incremental refactoring, enhancing documentation, and introducing automated testing, Enozom helps clients maintain and improve their legacy systems.What i s Legacy Code? Legacy code refers to any piece of software that is inherited from previous developers or that has been in use for a long time. Typically, this code is written in older programming languages or frameworks and often lacks modern practices like automated testing or clear documentation. While the term “legacy” might carry a negative connotation, it’s important to recognize that this code often powers critical business processes and applications that are still in use today.The Challenges of Legacy Code 1. Lack of Documentation: One of the most significant challenges with legacy code is the lack of documentation. Without clear documentation, understanding the purpose, functionality, and dependencies of the code can be incredibly difficult. This absence often leads to longer onboarding times for new developers and increases the risk of introducing bugs when changes are made."
    }
  ]
}